import { Paper, Typography } from "@mui/material";
import React from "react";

export const Offer = () => {

  return (
    <Paper  sx={{padding:"10px", width:'100%'}}>
      <Typography>
        Оферта<br/><br/>

        Настоящий публичный договор (далее — Оферта) представляет собой официальное предложение Самозанятого Саввинова Семёна Афанасьевича (ИНН 140204032344), 
        в дальнейшем именуемое Исполнитель, по оказанию информационных услуг с помощью программного обеспечения сайта hrminer.ru, 
        (далее — Сайт) юридическим и/или дееспособным физическим лицам на перечисленных ниже условиях в формате онлайн-тестирования.<br/><br/>

        В соответствии со ст. 438 Гражданского Кодекса РФ (далее — ГК РФ) данный документ является публичной Офертой, 
        и в случае принятия изложенных ниже условий и оплаты (частичной оплаты) услуг Исполнителя, лицо осуществившее таким образом Акцепт настоящей Оферты, 
        становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт Оферты равносилен заключению договора на условиях, 
        изложенных в Оферте, что безоговорочно принимается сторонами). Датой Акцепта Оферты считается дата поступления 
        на счет Исполнителя оплаты или частичной оплаты Заказчиком услуг Исполнителя.<br/><br/>

        При совместном упоминании Заказчика и Исполнителя далее по тексту будем использовать слово Стороны, как термин, в написании со строчной буквы.<br/><br/>

        Исполнитель и Заказчик предоставляют взаимные гарантии своей право- и дееспособности, 
        необходимые для заключения и исполнения настоящего Договора на оказание информационных услуг.<br/><br/>

        1. <b>Определения и термины</b><br/>
        1.1. В целях настоящей Оферты нижеприведенные термины используются в следующем значении:<br/>

        <b>Исполнитель</b><br/>
        Самозанятый Саввинов Семён Афанасьевич (ИНН 140204032344), предоставляющий Информационные услуги Заказчику на условиях настоящей Оферты.<br/>

        <b>Заказчик</b><br/>
        Любое лицо, осуществившее Акцепт Оферты на изложенных в ней условиях.<br/>

        <b>Стороны</b><br/>
        Исполнитель и Заказчик, упоминаемые совместно.<br/>

        <b>Оферта</b><br/>
        Настоящий публичный договор на оказание информационных услуг.<br/>

        <b>Акцепт Оферты</b><br/>
        Полное и безоговорочное принятие Оферты путем осуществления действий по предварительной оплате Информационной услуги в размере 100%<br/>

        <b>Договор</b><br/>
        Договор на оказание информационных услуг (далее — Договор) — договор между Заказчиком и Исполнителем на предоставление Информационных услуг, 
        который заключается посредством Акцепта настоящей Оферты.<br/>

        <b>Сайт</b><br/>
        Интернет-сайт hrminer.ru, используемый Исполнителем для предоставления Информационных услуг.<br/>

        <b>Сессия</b><br/>
        Сессия — это сеанс работы пользователя с сайтом, в течение которого серверный механизм позволяет отслеживать пользователя Сайта 
        и хранить данные для конкретного пользователя между переходами по страницам сайта. Длительность Сессии на Сайте — 24 часа. 
        С помощью сессии реализуется хранение параметров и результата тестирования, корзина покупок, результаты исполнения Информационных услуг и другое. 
        Для реализации Сессий Сайт использует файлы cookie. Правила обращения с личными данными пользователя 
        и использование cookie на Сайте регламентируется Политикой конфиденциальности, являющейся неотъемлемой частью настоящей Оферты.<br/>

        <b>Информационные услуги</b><br/>
        Услуги Исполнителя по предоставлению ограниченного доступа Заказчика к Сайту в соответствии с условиями Оферты для прохождения тестирования, 
        предоставление результатов тестирования, получения аналитической информации по результатам тестирования, 
        а также сопутствующих информационных услуг Исполнителя. Форма и порядок предоставления Информационных услуг определяются пунктом 4 настоящей Оферты.<br/>

        <b>Платёжная система</b><br/>
        Платёжная система — коммерческая технологическая система, используемая на основании договора с Исполнителем, 
        обеспечивающая получение Исполнителем денежных средств на Сайте по поручению Заказчика с использованием электронных платёжных средств. 
        Для осуществления платежей на этом Сайте Исполнитель использует услуги платёжной системы YooKassa.<br/><br/>

        2. <b>Предмет оферты</b><br/>
        2.1. Предметом настоящей Оферты является возмездное оказание Заказчику Информационных услуг силами Исполнителя 
        в соответствии с условиями настоящей Оферты путем организации тестирования, автоматической компьютерной обработки результатов тестирования, 
        автоматического компьютерного анализа результатов тестирования и создание документа с результатами тестирования в формате PDF за вознаграждение, 
        выплачиваемое Заказчиком Исполнителю.<br/>

        2.2. Стоимость каждой Информационной услуги устанавливается на Сайте Исполнителя. 
        Договор на оказание Информационных услуг считается заключенным с момента получения Сайтом информации об успешном платеже 
        от Платёжной системы в момент возврата Исполнителя на Сайт после совершения платежа.<br/><br/>

        3. <b>Условия и порядок оказания Информационных услуг</b><br/>
        3.1. При заказе платных Информационных услуг на Сайте Заказчик направляется на сайт Платёжной системы для оплаты Информационных услуг. 
        После оплаты Заказчик обязан вернуться на Сайт для загрузки созданного документа с результатами тестирования и завершения получения Информационных услуг.<br/>

        3.2. При условии успешной оплаты Информационноых услуг и возврата на Сайт, 
        Исполнитель на срок действия Сессии пользователя предоставляет Заказчику ограниченный доступ 
        к Информационным услугам путём загрузки с Сайта документа в формате PDF, 
        являющегося результатом исполнения Информационных услуг.<br/>

        3.3. В случае, если после успешной оплаты Информационной услуги Заказчик вернулся на Сайт исполнителя, 
        но по той или иной причине не получил Информационной услуги, 
        указанную им на странице подтверждения заказа, ему необходимо обратиться за технической поддержкой по электронной почте hrminer@mail.ru<br/>

        3.4. Настоящий Договор имеет силу акта об оказании услуг. Приемка производится без подписания соответствующего акта.<br/>

        3.5. При работе с Сайтом собираются данные о пользователе. Правила сбора, хранения и уничтожения этих данных регулируются Политикой конфиденциальности, 
        которая опубликованя на Сайте Исполнителя и является неотъемлемой частью настоящего Договора.<br/>

        3.6. При работе с Сайтом Заказчик обязан соблюдать Правила использования сайта, 
        которые опубликованы на Сайте Исполнителя и являются неотъемлемой частью настоящего Договора.<br/>

        3.7. Запросы на техническую поддержку и приём претензий по качеству оказываемой Информационной услуги должны направляться 
        Заказчиком в адрес Исполнителя посредством подачи заявки на электронную почту: hrminer@mail.ru 
        Срок рассмотрения запросов на техническую поддержку составляет 5 (пять) рабочих дней, 
        а срок рассмотрения претензии Заказчика Исполнителем составляет 30 (тридцать) дней (в том числе претензий, 
        содержащих требование о возврате денежных средств) с момента поступления претензии в адрес Исполнителя.<br/><br/>

        4. <b>Права и обязанности сторон</b><br/>
        4.1. Исполнитель обязан<br/>
        4.1.1. Исполнитель обязуется предоставлять Заказчику услуги личностного тестирования, 
        отображение результатов тестирования и загрузки результатов тестирования с Сайта, 
        указываемую Заказчиком при заказе Информационной услуги посредством Сайта, на условиях, 
        регулируемых Условиями использования Сайта, являющихся неотъемлемой частью настоящего Договора.

        4.1.2. Исполнитель обязан исполнить Договор сразу же по возвращению Исполнителя с сайта Платёжной системы на Сайт Исполнителя.<br/>

        4.1.3. Исполнитель несет ответственность за хранение и обработку персональных данных Заказчика в рамках Политики конфиденциальности Сайта, 
        являющейся неотъемлемой частью настоящего Договора и использует их исключительно для качественного оказания Информационной услуги Заказчику.<br/>

        4.2. Исполнитель имеет право<br/>
        4.2.1. Исполнитель оставляет за собой право в любой момент изменять алгоритмы работы сайта с целью качественного оказания 
        Информационных услуг Заказчику без каких-либо уведомлений.<br/>

        4.2.2. Исполнитель имеет право отказать Заказчику в предоставлении платной Информационной услуги, 
        заблокировав форму оплаты заказа Информационной услуги на Сайте, если алгоритм Сайта обнаруживает, 
        что предоставленные Заказчиком данные (в том числе в ходе тестирования) не достаточны для предоставления Информационной услуги 
        или имеют достаточные признаки того, что результат Информационной услуги будет заведомо неверным.<br/>

        4.2.3. Исполнитель оставляет за собой право в любой момент изменять условия настоящей Оферты 
        в одностороннем порядке без предварительного уведомления Заказчика, публикуя указанные изменения на Сайте не позднее 5 дней со дня их внесения (принятия).<br/>

        4.3. Заказчик обязан<br/>
        4.3.1. Заказчик обязан предоставлять верные данные о себе, там где это требуется. 
        Предоставление неверных данных приведут к расчёту неверного результата тестирования. 
        Ответственность за предоставление неверных данных и получение вследствие этого неверных результатов 
        при оказании Информационной услуги целиком лежит на Заказчике.<br/>

        4.3.2. Заказчик обязан вернуться на Сайт Исполнителя после оплаты Информационных услуг для получения результата.<br/>

        4.3.3. Заказчик обязан поддерживать в исправном техническом состоянии оборудование и каналы связи, обеспечивающие ему доступ к Сайту. 
        Исполнитель не несет ответственности за непредоставление (некачественное предоставление) Информационных услуг по причинам, 
        не зависящим от Исполнителя.<br/>

        4.4. Заказчик имеет право<br/>
        4.4.1. Заказчик имеет право запросить техническую помощь в случае, если после успешной оплаты Информационных услуг Заказчик вернулся на Сайт исполнителя, 
        но при этом не получил оплаченных Информационных услуг.<br/>

        4.4.2. Заказчик пользуется всеми правами потребителя в соответствии с действующим законодательством Российской Федерации, 
        регулирующим отношения по возмездному оказанию услуг. Заказчик, в случае оказания ему услуги ненадлежащего качества, 
        вправе воспользоваться правами, предусмотренными ст. 22 Закона РФ «О защите прав потребителей», в случаях, 
        когда нарушение его прав произошло по вине Исполнителя и при доказанности указанного обстоятельства.<br/>

        4.4.3. Заказчик имеет право распоряжаться любыми данными, полученными на Сайте в рамках Условий использования Сайта.<br/><br/>

        5. <b>Ответственность сторон</b><br/>
        5.1. За неисполнение либо ненадлежащее исполнение обязательств по настоящей Оферте, 
        стороны несут ответственность в соответствии с законодательством Российской Федерации.<br/>

        5.2. Исполнитель и Заказчик, принимая во внимание характер оказываемой услуги, 
        обязуются в случае возникновения споров и разногласий, связанных с оказанием Информационной услуги, 
        применять досудебный порядок урегулирования спора. В случае невозможности урегулирования спора в досудебном порядке, стороны вправе обратиться в суд.<br/>

        5.3. Заказчик принимает на себя все риски, связанные с использованием знаний, 
        умений или навыков, полученных Заказчиком в ходе оказания Информационных услуг.<br/>

        5.4. Прием к рассмотрению претензий Заказчика с требованием о возврате денежных средств прекращается 
        по истечении 14 (четырнадцати) календарных дней с момента оказания услуг, что безоговорочно принимается Cторонами.<br/>

        5.5. В случае принятия решения Исполнителем о возврате денежных средств, Денежные средства возвращаются по правилам 
        и на условиях той Платёжной системы, через которую был осуществлён платёж.<br/><br/>

        6. <b>Срок действия Оферты</b><br/>
        6.1. Настоящий договор вступает в силу как оферта с момента его размещения на Сайте Исполнителя и действует до момента отзыва Оферты Исполнителем.<br/>

        6.2. Исполнитель оставляет за собой право вносить изменения в Оферту и/или отзывать его в любой момент по собственному усмотрению. 
        В случае внесения Исполнителем изменений в Оферту, таковые вступают в силу с момента размещения измененного текста Оферты на Сайте Исполнителя, 
        если иной срок не определен дополнительно при таком размещении.<br/>

        6.3. В рамках Оферты Заказчик производит её акцепт посредством оплаты/частичной оплаты счета, 
        что равносильно заключению договора (ст. 438 ГК РФ) на условиях оферты. Оплачивая счёт электронным средством платежа, 
        Заказчик выражает своё согласие на получение кассовых чеков в виде рассылки на указанный им адрес электронной почты 
        и на обработку предоставленных в связи с этим персональных данных, 
        в соответствии с п. 3 ст. 3 Федерального закона от 27.07.2006 г. № 152 ФЗ «О персональных данных».<br/>

        6.4. Оферта вступает в силу с момента акцепта Заказчиком и действует: а) либо до момента исполнения Сторонами обязательств по Оферте, 
        либо б) до момента расторжения Оферты.<br/>

        6.5. Заказчик соглашается и признает, что внесение изменений в текст Оферты влечет за собой внесение этих изменений 
        в заключенную и действующую между Сторонами Оферту, и эти изменения вступают в силу одновременно с такими изменениями в текст оферты.<br/>

        6.6. В случае отзыва оферты Исполнителем в течение срока действия Оферты, она считается прекращенной с момента отзыва, 
        если иное не оговорено Исполнителем при отзыве оферты.<br/><br/>

        7. <b>Обстоятельства непреодолимой силы</b><br/>
        7.1. Стороны не несут ответственности, предусмотренной настоящим Договором, если невозможность исполнения ими принятых 
        в Договоре обязательств наступила вследствие непреодолимой силы, т. е. чрезвычайных и непредотвратимых при данных условиях 
        обстоятельств (стихийное бедствие, пожар, наводнение, решение правительства и др., далее именуемых «Форс-мажор»). 
        Сторона, оказавшаяся под воздействием Форс-мажора, обязана в разумный срок информировать об этом другую Сторону в письменном виде. 
        Несвоевременное извещение об обстоятельствах непреодолимой силы лишает соответствующую сторону права ссылки на них.<br/>

        7.2. Сторона, оказавшаяся под воздействием Форс-мажора, обязана принять все зависящие от нее меры для выхода из него. 
        Форс-мажор автоматически продлевает срок исполнения обязательств по Договору. 
        Если Форс-мажор длится более 3 (трех) месяцев, то любая из Сторон вправе в одностороннем порядке расторгнуть Договор в отношении обязательств, 
        срок исполнения которых не наступил или исполнение которых не завершено на момент расторжения Договора, 
        в отношении неисполненной части. Договор будет считаться расторгнутой по причине длящихся форс-мажорных обстоятельств с даты, 
        когда одна из Сторон получила или должна получить письменное уведомление другой Стороны о расторжении.<br/><br/>

        8. <b>Заключительные положения</b><br/>
        8.2. Истечение срока действия Оферты не является основанием для прекращения срока исполнения обязательств Сторон по ней. 
        Обязательства прекращаются за их надлежащим исполнением.<br/>

        8.4. В случае изменения платежных реквизитов Исполнитель должен сообщать об этом путем публикации измененных данных на Сайте Исполнителя.<br/>

        8.5. Производя акцепт настоящей Оферты путем оплаты (частичной оплаты) счета Исполнителя, 
        Заказчик соглашается со всеми условиями Оферты, включая Политику конфиденциальности и Условия использования Сайта.<br/><br/>



        Самозанятый Саввинов Семён Афанасьевич,<br/>
        ИНН 140204032344<br/><br/>

        08.04.2023г.
      </Typography>
    </Paper>
  );
};
