import { Paper, Typography } from "@mui/material";
import React from "react";

export const Privacy = () => {

  return (
    <Paper sx={{ width: '100%', padding: '20px' }}>
      <Typography>
        Политика конфиденциальности<br/><br/>
        Самозанятый Саввинов Семён Афанасьевич, ИНН 140204032344 (далее — Самозанятый) управляет сайтом hrminer.ru (далее — Сайт) и поддерживает его. 
        На Сайте предоставляются услуги онлайн-тестирования, аналитики результатов тестирования и прочие информационные услуги.<br/><br/>

        В рамках этих действий Самозанятый получает, хранит и обрабатывает большое количество данных. <br/>
        В связи с этим Самозанятый разработал Политику конфиденциальности, которая регулирует сбор, хранение, использование, передачу 
        и раскрытие личной информации пользователей.<br/><br/>

        Прежде чем начинать работу с Сайтом, пожалуйста, уделите пару минут ознакомлению с нашей Политикой конфиденциальности, 
        а если возникнут вопросы — напишите нам.<br/><br/>

        Сбор и использование личной информации<br/><br/>
        Личной информацией являются данные, которые можно использовать для установления личности человека или для связи с ним, 
        обнаружения его местоположения, выявления его связи с другими лицами.<br/><br/>

        При использовании Сайта для прохождения тестирования и получения прочих услуг будет собрано большое количество информации, 
        в том числе личной. Эти сведения будут храниться и обрабатываться на серверах Сайта, поскольку они необходимы для предоставления услуг Сайта.<br/><br/>

        Сайт может получать ваши личные данные от иных организаций, которые были уполномочены вами на такие действия, например, в рамках партнёрских программ.<br/><br/>

        Какие личные данные Самозанятый собирает<br/><br/>
        При старте тестирования Самозанятый запросит имя, адрес электронной почты и номер телефона.
        При прохождении тестирования вам будет задано большое количество вопросов, ответы на многие из них можно расценивать как личную информацию.
        При оплате услуг Сайт получает техническую информацию об использованных платёжных средствах.<br/><br/>
        Как Самозанятый обрабатывает личные данные<br/><br/>
        Передавая нам личную информацию при использовании Сайта, вы автоматически выражаете согласие на её хранение и обработку на нашей стороне. 
        Самозанятый может обрабатывать вашу личную информацию в целях, описанных в этой Политике конфиденциальности, 
        с вашего согласия для соблюдения обязательств, связанных с выполнением информационных услуг Сайта, 
        для защиты ваших интересов, или когда это необходимо в законных и одобренных вами интересах Самозанятого или третьей стороны, 
        которой может потребоваться раскрыть информацию.<br/><br/>

        Во время тестирования Самозанятый накапливает ответы на вопросы.<br/>
        По окончанию тестирования все собранные данные используются для подготовки итогового отчёта, 
        автоматического анализа результатов тестов и формирования текстового анализа.
        Полученный нами адрес электронной почты используется для отправки копий результатов услуг.
        Источники личных данных, когда Самозанятый получает их не от вас
        Самозанятый может получить ваши личные данные от ваших знакомых или работодателей, если они передали нам их в рамках партнёрских программ, 
        например, тестирования по запросу работодателя.
        Передача личной информации третьим лицам
        Самозанятый может передавать результаты вашего тестирования партнёрским 
        Центрам Оценки — организациям или частным специалистам.<br/><br/>

        Самозанятый обязан раскрыть вашу личную информацию органам государственной власти в случаях, 
        предусмотренных текущим законодательством Российской Федерации.<br/><br/>

        Сбор и использование обезличенной информации<br/><br/>
        Сайт также собирает данные, которые не связаны непосредственно с конкретным человеком. 
        Самозанятый может собирать, использовать, передавать и раскрывать такие данные с любой целью. 
        Например, Самозанятый может собирать информацию о действиях посетителей нашего веб-сайта. 
        Также Самозанятый может хранить обезличенные результаты тестов для последующего анализа 
        или в качестве тестовых данных для проверки работоспособности Сайта и/или его частей.<br/><br/>

        Файлы «cookie»<br/><br/>
        На Сайте используются файлы «cookie» (далее — Куки). Куки позволяют проводить длительное пошаговое тестирование, 
        пользоваться корзиной заказов платных услуг, хранить список купленных услуг и их результатов. 
        Помимо собственных Кук Сайта hrminer.ru используются Куки сервисов аналитики и систем приёма онлайн-платежей.<br/><br/>

        Вы можете отключить файлы Куки в настройках вашего браузера, но тогда Сайт окажется неработоспособным.<br/><br/>

        Сторонние сайты<br/><br/>
        Сайт может использовать системы анализа посещаемости и прочие сервисы третих сторон, например Яндекс.Метрику, счётчик Live Internet или Google Analytics. 
        Эти сервисы могут также размещать cookie или использовать иные технологии для отслеживания поведения пользователя и данных о нём.<br/><br/>

        Как Сайт, так и используемые сторонние ресурсы автоматически собирают определённую информацию и хранят её в лог-файлах веб-серверов. 
        Это ip-адрес, тип браузера, операционная система, кодировка, язык, веб-сайты переходов с/на страницу, 
        отметки даты/времени запроса, часовой пояс клиента и прочее. Такая информация используется для анализа оборудования и программного обеспечения, 
        используемого пользователями, изучения поведения пользователей на сайте, улучшения работы наших сайтов и сервисов. 
        Также Самозанятый может использовать эту информацию в маркетинговой аналитике.<br/><br/>

        На Сайте могут содержаться ссылки, ведущие на сторонние веб-сайты. 
        Взаимоотношения этих сторонних сайтов с пользователем регулируются их политиками конфиденциальности. 
        Ознакомитесь с политиками конфиденциальности таких третьих сторон.<br/><br/>

        Хранение, передача и защита данных<br/><br/>
        Хранение и обработка всей собираемой информации выполняется на наших серверах. 
        Серверы расположены в сертифицированном центре обработки данных в специальном помещении, 
        оснащённом физическими средствами ограничения доступа под круглосуточной охраной. 
        Самозанятый прикладывает все возможные усилия для сохранения всей переданной информации в тайне от третих лиц.<br/><br/>

        По всем вопросам, связанных с Сайтом, Самозанятый ведёт переписку по электронной почте hrminer@mail.ru. <br/><br/>
        Передача данных в большинстве современных почтовых систем осуществляется в шифорванном виде с использованием защищённых протоколов передачи данных.<br/><br/>

        Обновления Политики конфиденциальности<br/><br/>
        Самозанятый периодически обновляет Политику конфиденциальности. 
        В случае внесения существенных изменений в этот документ обновлённая Политика будет размещена на данной странице.<br/><br/>



        Самозанятый Саввинов Семён Афанасьевич<br/>
        08.04.2023г.
      </Typography>
    </Paper>
  );
};
