import { Paper, Typography } from "@mui/material";
import React from "react";

export const Terms = () => {

  return (
    <Paper sx={{padding:"10px", width:'100%'}}>
        <Typography>Условия использования сайта<br/><br/>

Веб-сайт hrminer.ru (далее — Сайт), связанные с ним промосайты, дочерние сайты и онлайн-сервисы предоставляются на условиях «КАК ЕСТЬ» и «КАК ДОСТУПНЫ».<br/><br/>

Право собственности<br/><br/>
Весь текст, графика, пользовательские интерфейсы, визуальные интерфейсы, фотографии, звуки, музыка, 
изображения и программные коды (совместно именуемые «Содержимое»), включая дизайн, структуру сайта, 
внешний вид, общий стиль и расположение данного Содержимого, входящего в состав Сайта, 
связанных с ним дочерних сайтов и промосайтов, принадлежат и управляются Самозанятым Саввиновым Семёном Афанасьевичем ИНН 140204032344 (далее — Самозанятый).
<br/><br/>
Самозанятый не возражает против копирования открытых для общего доступа материалов сайта.
Самозанятый считает, что запрещать копирование открытой информации бессмысленно, бесполезно и антисоциально. Однако, 
при копировании материалов Сайта Самозанятый просит вас поставить ссылку на Сайт
 — таким образом вы предоставите вашему получателю информации достоверные сведения об источнике этих данных, 
 соблюдёте правила хорошего тона и полную законность действий. Пожалуйста, уважайте источник информации и своего читателя.
<br/><br/>
Использование сайта<br/><br/>
Вы можете использовать этот Сайт как вам вздумается, если это не противозаконно и не причинит никому никакого вреда.
<br/><br/>
Запрещается пытаться получить несанкционированный доступ к любой части или функции Сайта, 
любым другим системам или сетям, относящимся к Сайту или любому серверу Самозанятого, 
и любым услугам, предлагаемым на Сайте или посредством Сайта, путем взлома, 
анализа или подбора пароля или любыми другими незаконными средствами. 
Запрещается отслеживать или пытаться отслеживать любую информацию о любом другом пользователе, 
посетителе Сайта или любом другом клиенте Самозанятого, включая любые не принадлежащие вам учетные записи Самозанятого, 
до источника, а также любым способом использовать Сайт или любую услугу или информацию, 
доступную на Сайте или предлагаемую посредством Сайта, если целью является раскрытие любой информации, 
включая, помимо прочего, личную идентификационную информацию или информацию, которая вам не принадлежит, на условиях Сайта.
<br/><br/>
Самозанятый рассчитывает на вашу адекватность и приверженность принципам свободы и взаимопонимания в интернете. 
Однако, Самозанятый будет рассматривать как кибератаку:
<br/>
- Действия, создающие необоснованную или непропорционально большую нагрузку на инфраструктуру Сайта, сетей и систем Самозанятого;
<br/>- Использование устройств, программ или процедур для вмешательства в надлежащее функционирование Сайта любых операций, 
проводимых на Сайте, или вмешательство в использование Сайта любым другим лицом;
<br/>- Умышленное нарушение систем безопасности или аутентификации на Сайте или в любых сетях, относящихся к Сайту.
При выявлении кибератак Самозанятый будет вынужден предпринимать соответствующие технические и правовые действия в отношении лиц, 
групп лиц и организаций, инициировавших, организовавших и выполнявших эти действия.
<br/>
Вы соглашаетесь с тем, что Самозанятый может по своему усмотрению без предварительного уведомления прекратить ваш доступ к Сайту 
или частям Сайта по следующим причинам:
<br/>
- По запросам правоохранительных или иных государственных органов;<br/>
- По вашему запросу (например, удаление учётной записи по собственному желанию);<br/>
- В связи с удалением неактуальных материалов Сайта или любой услуги, предлагаемой на Сайте;<br/>
- В связи с техническими неполадками на Сайте или проблемами с каналами связи.<br/><br/>
Отказ от ответственности<br/><br/>
Самозанятый не обещает, что сайт, его содержимое, услуга или сервис сайта будет работать всегда, 
бесперебойно и без ошибок. Самозанятый не обещает, что будем реагировать в течение определённого времени на сбои и ошибки. 
Самозанятый не обещает, что использование вами сайта приведёт к определённым и гарантированным результатам. 
Любая информация на сайте может быть изменена без каких-либо уведомлений. 
Самозанятый не даёт гарантий, что любые данные, загружаемые с сайта не содержат вирусов или иных вредоносных программ.
<br/><br/>
Самозанятый не даёт каких-либо гарантий, явных или подразумеваемых, по точности данных, соблюдении прав, пригодности данных для использования.
<br/><br/>
Ни при каких обстоятельствах, за исключением случаев, предусмотренных действующим законодательством, 
Самозанятый не несёт перед вами ответственность за любые косвенные, штрафные, случайные или карательные убытки, 
включая потерю прибыли, даже если вы предупреждали о возможности таких убытков.
<br/><br/>
Ссылки на внешние сайты<br/><br/>
Сайт может содержать ссылки на другие независимые веб-сайты третьих сторон. Самозанятый не контролирует сайты третьих сторон, 
не несёт за них ответственность за их содержимое, не рекламирует их. 
Вам необходимо принять собственное независимое решение относительно работы с этими сайтами третьих сторон.
<br/><br/>
Самозанятый Саввинов Семён Афанасьевич<br/>
08.04.2023г.
</Typography>
    </Paper>
  );
};
