

export const steps = [
    {
        label: "Вы испытываете энергию, когда находитесь в толпе людей или на общественных мероприятиях",
        variant1: "экстраверт",
        variant2: "интроверт",
    },
    {
        label: "Вам нравится проводить время в одиночестве, чтобы перезарядить свои батареи",
        variant1: "интроверт",
        variant2: "экстраверт",
    },
    {
        label: "Вы часто инициируете социальную активность - включая звонки, встречи и т.д.",
        variant1: "экстраверт",
        variant2: "интроверт",
    },
    {
        label: "Вам нравится быть в центре внимания на общественных мероприятиях",
        variant1: "экстраверт",
        variant2: "интроверт",
    },
    {
        label: "Вы предпочитаете работать один на один с клиентами или коллегами",
        variant1: "интроверт",
        variant2: "экстраверт",
    },
    {
        label: "Вам нравится планировать мероприятия и собирать людей вместе",
        variant1: "экстраверт",
        variant2: "интроверт",
    },
    {
        label: "Вы предпочитаете говорить, чем слушать",
        variant1: "экстраверт",
        variant2: "интроверт",
    },
    {
        label: "Вам легко знакомиться с новыми людьми",
        variant1: "экстраверт",
        variant2: "интроверт",
    },
    {
        label: "Вы часто чувствуете себя запуганным в новых организациях или в эмоционально насыщенных ситуациях?",
        variant1: "интроверт",
        variant2: "экстраверт",
    },
    {
        label: "Вы обычно принимаете решения, основываясь на фактах и логике",
        variant1: "логик",
        variant2: "этик",
    },
    {
        label: "Вы склонны устанавливать строгие правила и границы для себя и других людей",
        variant1: "логик",
        variant2: "этик",
    },
    {
        label: "Решающее значение в жизни имеют ваши чувства и эмоции",
        variant1: "этик",
        variant2: "логик",
    },
    {
        label: "Вам нравится работать с другими людьми, чтобы достичь общей цели",
        variant1: "этик",
        variant2: "логик",
    },
    {
        label: "Вы часто учитываете эмоциональные аспекты при принятии решений",
        variant1: "этик",
        variant2: "логик",
    },
    {
        label: "Вы легко можете объяснить свои действия, приводя детальные аргументы и обоснования",
        variant1: "логик",
        variant2: "этик",
    },
    {
        label: "Вы обычно проявляете эмпатию и сострадание к другим людям",
        variant1: "этик",
        variant2: "логик",
    },
    {
        label: "Вам нравится анализировать сложные проблемы и искать эффективные решения",
        variant1: "логик",
        variant2: "этик",
    },
    {
        label: "Вам нравится принимать важные решения с учетом личных мнений и чувств",
        variant1: "этик",
        variant2: "логик",
    },
    {
        label: "Вы обычно ориентированы на факты и опыт, когда решаете проблемы",
        variant1: "сенсор",
        variant2: "интуит",
    },
    {
        label: "Вы часто думаете о будущих возможностях и новых идеях",
        variant1: "интуит",
        variant2: "сенсор",
    },
    {
        label: "Вы склонны оценивать ситуации и людей исходя из своих личных ощущений и впечатлений",
        variant1: "интуит",
        variant2: "сенсор",
    },
    {
        label: "Вам интересны и важны - факты и реальность чем абстрактные идеи и возможности",
        variant1: "сенсор",
        variant2: "интуит",
    },
    {
        label: "Вам не нравится работа, где нужно использовать свою фантазию",
        variant1: "сенсор",
        variant2: "интуит",
    },
    {
        label: "Вы обычно принимаете решения - обдумывая многие варианты и взвешивая их",
        variant1: "сенсор",
        variant2: "интуит",
    },
    {
        label: "Вы часто замечаете детали и мелочи в окружающей среде?",
        variant1: "сенсор",
        variant2: "интуит",
    },
    {
        label: "Вы склонны доводить вещи до логического конца, даже если это утомительно",
        variant1: "сенсор",
        variant2: "интуит",
    },
    {
        label: "Вам интересно исследовать новые идеи и направления в жизни",
        variant1: "интуит",
        variant2: "сенсор",
    },
    {
        label: "Вы склонны действовать спонтанно, без планирования заранее",
        variant1: "иррационал",
        variant2: "рационал",
    },
    {
        label: "Вы предпочитаете работать с долгосрочными планами, вместо краткосрочных целей и задач",
        variant1: "рационал",
        variant2: "иррационал",
    },
    {
        label: "Вам нравится экспериментировать с новыми идеями и подходами?",
        variant1: "иррационал",
        variant2: "рационал",
    },
    {
        label: "Вы часто думаете о том, как изменить и улучшить свой жизненный опыт",
        variant1: "иррационал",
        variant2: "рационал",
    },
    {
        label: "Вы предпочитаете структурировать время и планировать каждый шаг",
        variant1: "рационал",
        variant2: "иррационал",
    },
    {
        label: "При оценке результатов работы, Вы обычно оцениваете отдельные компоненты и детали",
        variant1: "рационал",
        variant2: "иррационал",
    },
    {
        label: "Вы предпочитаете учиться на ходу и осваивать то, что необходимо в конкретной ситуации",
        variant1: "иррационал",
        variant2: "рационал",
    },
    {
        label: "Вы воспринимаете новую информацию, обращая внимание на детали и особенности",
        variant1: "иррационал",
        variant2: "рационал",
    },
    {
        label: "Вы обычно детально планируете каждый шаг",
        variant1: "рационал",
        variant2: "иррационал",
    },
];

