import { Typography } from "@mui/material"

export const ISTJ = <Typography><b>Описание типа личности:</b><br/>
Это логически мыслящий и организованный тип личности, 
который знаменит своей ответственностью и сосредоточенностью на деталях. 
Они любят следовать определенным правилам и процедурам и склонны к сохранению статус-кво. 
Ориентированы на достижение целей и практические результаты, 
их работа характеризуется высокой приверженностью и дисциплиной.<br/><br/>

<b>Сильные стороны:</b><br/>
Надежные и ответственные работники, 
чей труд характеризуется точностью и пунктуальностью. 
Являясь хорошими логиками, они рационально оценивают ситуации, 
избегают рисков и проявляют рациональность при принятии решений.<br/><br/>

<b>Слабые стороны:</b><br/> часто слишком пристрастны к следованию правилам, 
что может препятствовать инновациям или решению проблем. 
Иногда они могут быть недостаточно гибкими в обстановках, 
которые требуют быстрого реагирования. 
Также они склонны к подавлению своих эмоций 
и могут не замечать эмоциональных потребностей окружающих.<br/><br/>

<b>Подходящие профессии:</b><br/>
Наиболее успешны в профессиях, где необходимо высокое качество, 
точность и дисциплина, например, бухгалтеры, юристы, инженеры, 
менеджеры по производству, педагоги, врачи и др.</Typography>

export const ISFJ = <Typography><b>Описание типа личности:</b><br/>
Это бережный и дружелюбный тип личности, 
который проявляет заботу о своих коллегах и организации. 
Они чувствительны к потребностям других людей 
и склонны к следованию традициям и установленным правилам. 
Могут оказаться бесценным активом для компании благодаря своей надежности и заботливости.<br/><br/>

<b>Сильные стороны:</b><br/> Лучшие практические работники, 
надежные и добросовестные. Они сильны в межличностных 
взаимодействиях и заботятся о комфорте окружающих, 
проявляют высокую степень дисциплины и ответственности в своей работе.<br/><br/>

<b>Слабые стороны:</b><br/> Им может не хватать уверенности в себе в новых ситуациях, 
они могут слишком привязываться к традициям и прошлому, 
что может препятствовать инновациям. Они могут не проявлять 
достаточное количеством инициативы и креативности.<br/><br/>

<b>Подходящие профессии:</b><br/>
Имеют отличные навыки в области организации и межличностных отношений, 
поэтому они выгодно проявляют себя в области медицины, 
образования, библиотечных, юридических и административных профессиях.</Typography>

export const INFJ = <Typography><b>Описание типа личности:</b><br/>
Это интуитивный и эмпатичный тип личности, 
который ориентирован на помощь людям и обществу в целом. 
Они обладают необычайной способностью понимать 
и чувствовать потребности других людей и могут подойти для ролей, 
связанных с социальной работой, консультированием, преподаванием и терапией. 
Могут оказаться ценным активом для компании благодаря своей креативности 
и способности к анализу сложных ситуаций.<br/><br/>

<b>Сильные стороны:</b><br/> Творческие и интуитивные, 
они могут оказаться инноваторами в своей области. 
Они искренне заботятся о других людях и могут быть великолепными лидерами и наставниками. 
Имеют высокую социальную ответственность 
и обладают уникальной способностью рассматривать проблемы со всех сторон.<br/><br/>

<b>Слабые стороны:</b><br/> Им может не хватать уверенности в себе 
и они могут слишком часто сомневаться в своих способностях. 
Они могут страдать из-за перенасыщения эмоций других людей 
и быть недостаточно осторожными в отношении личной границы. 
Иногда могут слишком увлекаться вопросами человеческой психологии, 
что может привести к недостаточному вниманию к коммерческой стороне бизнеса.<br/><br/>

<b>Подходящие профессии:</b><br/>
Могут оказаться ценным активом в таких областях, 
как психология, социальная работа, преподавание, медицина и искусство. 
Эти профессии позволяют проявлять свои качества, 
такие как социальная ответственность, эмпатия, креативность и интуиция.</Typography>

export const INTJ = <Typography><b>Описание типа личности:</b><br/> 
Это логический и стратегический тип личности, 
который ориентирован на достижение целей и построение систем. 
Они обладают уникальной способностью видеть вещи далеко вперед 
и могут подойти для ролей, связанных с управлением, 
техническими науками и научными исследованиями. 
Могут оказаться ценным активом для компании благодаря своей аналитической и стратегической мысли.<br/><br/>

<b>Сильные стороны:</b><br/> Логические и аналитические, 
они могут быстро и точно анализировать сложные ситуации. 
Они не боятся принимать решения и могут быстро оценить риски и возможности. 
Обладают высокими стандартами и ориентированы на качество во всех аспектах работы.<br/><br/>

<b>Слабые стороны:</b><br/> Им может не хватать эмоциональной связи 
с окружающими и они могут слишком сосредоточиться на своих личных целях, 
упуская из виду проблемы других людей. Могут вырабатывать негативное отношение 
к критике и не учитывать мнения других. Иногда могут увлекаться деталями и перфекционизмом, 
что может затягивать работу и приводить к появлению отставания от графика.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут оказаться ценным активом в таких областях, 
как научные исследования, управление, консалтинг, технические науки и финансы. 
Эти профессии позволяют проявлять свои качества, такие как аналитический склад ума, 
стратегическое мышление и умение быстро принимать решения.</Typography>

export const ISTP = <Typography><b>Описание типа личности:</b><br/> 
Это технический и практичный тип личности, 
который обладает уникальной способностью быстро адаптироваться 
к новым ситуациям и решать проблемы. Они могут подойти для ролей, 
связанных с инженерией, технологией и производством. 
Могут оказаться ценным активом для компании благодаря 
своей способности к рациональному мышлению и умению быстро решать проблемы.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают острым умом и способностью 
быстро решать практические задачи. Они хорошо адаптируются 
к изменяющимся ситуациям и могут эффективно работать в условиях высокого давления. 
Ориентированы на результат и умеют находить оптимальные решения для достижения целей.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть недостаточно организованными и склонными к риску, 
что может приводить к некоторому беспорядку в работе. 
Их также может не хватать социальных навыков и они могут нуждаться в помощи в коммуникации с другими людьми. 
Могут иногда значительно затягивать принятие решений, что может отразиться на повседневной работе.<br/><br/>

<b>Подходящие профессии:</b><br/>
Могут оказаться ценным активом в таких областях, как производство, 
инженерия, технологии, авиация, строительство и очень подходят для профессий 
требующих быстрого реагирования на переменные и логичного мышления.</Typography>

export const ISFP = <Typography>
    <b>Описание типа личности:</b><br/>
Это творческий и чувствительный тип личности, 
который обладает уникальной способностью работать с эмоциями 
и воплощать свою интуицию в жизнь. 
Они могут быть ценным активом для компаний, 
связанных с искусством, дизайном, модой, музыкой и другими творческими областями. 
Могут оказаться ценным активом для компаний благодаря своей способности к эмпатии и умению создавать красоту.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают креативным мышлением 
и способностью видеть мир своим уникальным образом. 
Они обладают чувством стиля и склонны к творческому проявлению себя. 
Довольно эмпатичны и могут понимать эмоции других людей, 
что позволяет им создавать уникальные и проникновенные произведения искусства.<br/><br/>

<b>Слабые стороны:</b><br/> Иногда склонны к прокрастинации и отсутствию организации, 
что может повредить их результативности и производительности. 
Они могут также чувствительно воспринимать критику, 
что может приводить к неэффективной коммуникации на рабочем месте. 
Также могут нуждаться в некоторой степени направляющей поддержки 
и инструкциях, чтобы достичь лучших результатов.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в таких областях, 
как искусство, дизайн, мода, музыка, графический дизайн и другие творческие области. 
Они хорошо работают в группах, которые ценят креативность и интуицию.</Typography>

export const INFP = <Typography>
<b>Описание типа личности:</b><br/>
Это идеалистичный и вдохновенный тип личности, 
который обладает уникальным чувством морали и справедливости. 
Они могут быть ценным активом для компаний, занимающихся социальными вопросами, 
образованием, искусством и другими областями, 
связанными с креативностью и эмоциональной глубиной. 
Могут оказаться ценным активом для компаний благодаря своей способности 
выражать эмоции и восхищаться красотой.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают уникальным чувством морали и справедливости, 
а также могут быть чувствительными к потребностям других людей. 
Они могут лучше понимать эмоции других людей и могут создавать уникальные 
и вдохновляющие произведения искусства. Обычно чувствительны и 
к своим эмоциям и могут являться хорошими дипломатами на рабочем месте.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть слишком критичны к себе и своей работе, 
что может приводить к прокрастинации и отсутствию организации. 
Они могут быть склонны к принятию решений на основе эмоций, 
что может привести к неэффективным решениям на рабочем месте. 
Могут также нуждаться в большей ясности и структуре в заданиях, 
чтобы достичь лучших результатов.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в социальных вопросах, 
образовании, искусстве, культуре и других областях, которые ценят креативность и эмпатию. 
Они могут также хорошо работать в таких областях, как свободные искусства, 
литература, музыка и другие творческие области.</Typography>

export const INTP = <Typography>
    <b>Описание типа личности:</b><br/>
Это аналитический и интеллектуальный тип личности, 
который может стать ценным активом для компаний, занимающихся наукой, 
технологией, инновациями и другими областями, требующими глубокой аналитики и логического мышления. 
Могут помочь компаниям в поиске новых идей 
и разработке инновационных проектов благодаря 
своей способности анализировать информацию и получать новые знания.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают уникальной способностью анализировать 
и обрабатывать информацию, а также могут отличаться своими логическим 
и критическим мышлением. Они часто способны находить новые идеи и решения для сложных проблем, 
а также могут хорошо работать в напряженных ситуациях. 
Обычно ценят свою независимость и могут хорошо работать самостоятельно.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть склонны к анализу и переработке информации до бесконечности, 
что может вести к прокрастинации и отсутствию организации. 
Они могут также быть несколько социально неуклюжими и иметь трудности 
в коммуникации с другими людьми. Также могут нуждаться в большей мотивации 
и стимуле, чтобы достигать лучших результатов.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в таких областях, 
как наука, технология, инновации, инженерия и другие области, 
где требуется скрупулезная аналитика и логическое мышление. 
Они могут также хорошо работать в таких областях, как компьютерные науки, математика, 
статистика и другие области, требующие глубокой экспертизы и знаний.</Typography>

export const ESTP = <Typography><b>Описание типа личности:</b><br/>
Это энергичный и действенный тип личности, 
который может стать ценным активом для компаний, 
занимающихся бизнесом, маркетингом, продажами и другими областями, 
которые требуют быстрого принятия решений и эффективного взаимодействия с людьми. 
Они могут помочь компаниям в установлении контактов с новыми клиентами 
и увеличении продаж благодаря своей спонтанности и открытости.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают высокой энергией и мастерством во взаимодействии с людьми. 
Они обычно способны легко и быстро адаптироваться к новым ситуациям и быстро принимать решения. 
Отличаются своей активностью и инициативностью, 
что позволяет им легко находить новые возможности и развивать бизнес.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть несколько нерешительными в долгосрочном планировании 
и стратегическом мышлении. Им может не хватать терпения и упорства, 
чтобы достичь долгосрочных целей. Также они могут быть склонны к рискованным решениям 
и чрезмерной уверенности в себе, что может приводить к проблемам.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в таких областях, как бизнес, 
маркетинг, продажи и другие области, требующие быстрого принятия решений 
и эффективного взаимодействия с людьми. Они могут также хорошо работать в таких областях, 
как спорт, развлечения, гостиничный бизнес и др.</Typography>

export const ESFP = <Typography>
    <b>Описание типа личности:</b><br/>
Это жизнерадостный и эмоциональный тип личности, 
который может стать ценным активом для компаний, занимающихся бизнесом, 
маркетингом, продажами и другими областями, которые требуют внимательности 
к клиентам и развития связей. Могут помочь компаниям в привлечении новых 
клиентов и укреплении имиджа благодаря своей общительности и энтузиазму.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают высоким чувством юмора, теплой натурой 
и легкостью в общении с людьми. Они имеют отличные навыки в межличностных отношениях 
и могут быстро наладить связи с новыми людьми. Также обладают энергией и оптимизмом, 
что может помочь им в нахождении новых возможностей и создании выгодных условий для бизнеса.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть иногда не такими организованными и системными, 
как это требуется для выполнения более рутинных задач. Они могут также проявлять 
излишнюю чувствительность к критике и критику, что может затруднять достижение целей. 
Могут иногда быть несколько склонны к переключению между различными проектами, 
что может приводить к недостатку фокуса и концентрации.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в таких областях, как бизнес, 
маркетинг, продажи, гостеприимство и другие области, которые требуют внимания к 
клиентам и межличностным отношениям. Они могут также хорошо работать в культурных индустриях, 
таких как музыка, театр и искусство.</Typography>

export const ENFP = <Typography>
    <b>Описание типа личности:</b> <br/>
Это креативный и вдохновленный тип личности, 
который может стать ценным активом для компаний, 
занимающихся маркетингом, рекламой, социальными медиа 
и другими областями, которые требуют воображения и новаторства. 
Они могут помочь компаниям в развитии новых идей и творческом подходе к проблемам.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают творческим мышлением, 
энергией и оптимизмом, что может помочь им в нахождении новых решений 
и создании выгодных условий для бизнеса. Они могут быть отличными коммуникаторами, 
что позволяет им находить общий язык с людьми из разных сфер 
и устанавливать продуктивные рабочие отношения.<br/><br/>

<b>Слабые стороны:</b><br/>Могут иногда склоняться к проявлению некоторой непостоянности 
и неустойчивости в работе, особенно если им не удастся увлечься проектом. 
Они могут также проявлять излишнюю эмоциональность в работе и могут терять концентрацию в долгосрочных задачах.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в таких областях, 
как маркетинг, реклама, социальные медиа, образование, визуальные искусства 
и другие области, которые требуют креативности и инновационного подхода к работе.</Typography>

export const ENTP = <Typography>
    <b>Описание типа личности:</b><br/>
Это тип личности с развитым интеллектом и аналитическим мышлением. 
Они могут быть ценным активом для компаний, занимающихся консалтингом, исследованиями, 
разработкой продуктов и других областей, которые требуют инновационного и рационального подхода.<br/><br/>

<b>Сильные стороны:</b><br/> Обычно обладают развитой интуицией и энергией, 
что позволяет им быстро анализировать сложные проблемы и находить эффективные решения. 
Они могут быть отличными коммуникаторами и аргументаторами, 
что позволяет им убеждать и вдохновлять других людей.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть склонны к проявлению некоторой непостоянности 
и неорганизованности в работе, особенно если им не удастся заинтересоваться проектом. 
Они могут также проявлять излишнюю агрессивность и нетерпимость к другим людям.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в таких областях, как консалтинг, 
исследования, разработка продуктов, IT, маркетинг и другие области, 
которые требуют инновационного и рационального подхода к работе.</Typography>

export const ESTJ = <Typography>
    <b>Описание типа личности:</b><br/> 
Это тип личности с организованным и практичным подходом к работе. 
Они могут быть ценным активом для компаний, занимающихся управлением, производством, 
бухгалтерией и другими областями, которые требуют тщательного планирования 
и эффективного управления ресурсами.<br/><br/>

<b>Сильные стороны:</b><br/> Обычно обладают высоким уровнем ответственности и усердия. 
Они предпочитают работать в ясно определенных структурах и процессах, 
что позволяет им быть более продуктивными.Могут также быть отличными лидерами, 
которые способны мотивировать и организовывать других людей.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть склонны к консервативному и органиченному мышлению, 
а также к недостаточному вниманию новым идеям и методам работы. 
Они могут также проявлять излишнюю жесткость и категоричность в процессе принятия решений.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в таких областях, 
как управление, производство, бухгалтерия, юриспруденция, медицина 
и другие области, которые требуют тщательного планирования и эффективного управления ресурсами.</Typography>

export const ESFJ = <Typography>
    <b>Описание типа личности:</b><br/> 
Это тип личности с эмоциональным и социальным подходом к работе. 
Они могут быть ценным активом для компаний, занимающихся социальными услугами, 
продажами, маркетингом и другими областями, которые требуют внимания к клиентам 
и хорошим коммуникативным навыкам.<br/><br/>

<b>Сильные стороны:</b><br/> Обычно обладают высоким уровнем эмоциональной и социальной интеллектуальности. 
Они предпочитают работать в команде и могут быть отличными командными игроками. 
Могут также быть отличными обслуживающими работниками, которые способны отзываться 
на нужды клиентов и хорошо ориентированы в социальных взаимоотношениях.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть склонны к перфекционизму и излишней заботе о других людях. 
Иногда они могут забывать о своих собственных потребностях и занятости. 
Также могут страдать от боязни конфликтов и избегать принятия решений, 
которые могут привести к потенциальному конфликту.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут быть ценным активом в областях, 
таких как социальные услуги, продажи, маркетинг, образование, здравоохранение, 
гостеприимство и другие области, которые требуют хороших коммуникативных навыков и внимания к клиентам.</Typography>

export const ENFJ = <Typography>
    <b>Описание типа личности:</b><br/>
Это тип личности, который обладает высоким уровнем эмоциональной 
и социальной интеллектуальности. Они могут быть ценным активом для компаний, 
которые занимаются маркетингом, рекламой, управлением ресурсами человеческих кадров, 
образованием и другими областями, которые требуют лидерства, коммуникации и умения вести переговоры.<br/><br/>

<b>Сильные стороны:</b><br/> Обладают высоким уровнем эмпатии, 
они легко устанавливают контакт с другими людьми и обладают 
способностью мотивировать и организовывать их. 
Они ориентированы на результаты и приоритет ставят на благополучие команды и клиентов. 
Также обладают высоким уровнем социального интеллекта, 
что делает их способными решать сложные социальные проблемы 
и организовывать эффективное взаимодействие во время коллективных проектов и совместных дел.<br/><br/>

<b>Слабые стороны:</b><br/> Могут быть склонны к излишней заботе о своих сотрудниках и клиентах, 
что может привести к выгоранию и изматыванию. Они могут также страдать от перфекционизма, 
который может замедлять их работу. Могут бояться конфликтов, 
что может привести к избеганию принятия решений, необходимых для успешного завершения задачи.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут проявить себя в профессиях, 
связанных с управлением персоналом, маркетингом, образованием, рекламой, 
психологией и других областях, где они смогут использовать 
свои лидерские и организационные способности.</Typography>

export const ENTJ = <Typography>
    <b>Описание типа личности:</b><br/>
Это тип личности, который обладает высокой энергией, 
лидерскими способностями и стремлением к достижению целей. 
Они могут быть ценными для компаний, 
которые нуждаются в уверенных и эффективных руководителях.<br/><br/>

<b>Сильные стороны:</b><br/> обладают развитыми лидерскими качествами, 
они легко организуют и управляют командами и эффективно решают проблемы. 
Они имеют высокий уровень аналитических навыков, что позволяет 
им участвовать в стратегических планированиях. 
Хорошо знают свои цели и работают на их достижение, 
они умеют работать в условиях стресса и неутомимо продолжают двигаться вперед.<br/><br/>

<b>Слабые стороны:</b><br/>Могут быть чрезмерно критичными 
и иметь высокие стандарты как для себя, так и для других. 
Они могут быть властными и высказывать свою точку зрения настойчиво, 
что может приводить к конфликтам в рабочей команде. 
Также могут быть неуверенными в отношении ситуаций, 
которые не имеют строгих правил или градаций.<br/><br/>

<b>Подходящие профессии:</b><br/> Могут проявить себя в профессиях, 
связанных с управлением, правом, финансами, наукоемких отраслях, 
связанных с технологиями и инженерией, а также в маркетинге и рекламе.</Typography>